import 'package:flutter/material.dart';
import 'package:soom/presentation/components/appbar/app_bar.dart';
import 'package:soom/presentation/screens/main_view/bloc/home_cubit.dart';
import 'package:soom/style/color_manger.dart';
import 'package:soom/style/text_style.dart';

class QAScreen extends StatefulWidget {
   const QAScreen({Key? key}) : super(key: key);
  @override
  _QAScreenState createState() => _QAScreenState();
}

class _QAScreenState extends State<QAScreen> {
  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        backgroundColor: ColorManger.white,
        appBar: AppBars.appBarGeneral(context, HomeCubit(), "الأسئلة الشائعة" , cartView: false),
        body: Container(
          padding: const EdgeInsets.all(10),
          child: Padding(
            padding: const EdgeInsets.all(.0),
            child: ListView.builder(
              itemCount: itemData.length,
              itemBuilder: (BuildContext context, int index) {
                return ExpansionPanelList(
                  animationDuration: const Duration(milliseconds: 1000),
                  dividerColor: Colors.red,
                  elevation: 1,
                  children: [
                    ExpansionPanel(
                      body: Container(
                        padding: const EdgeInsets.all(16),
                        child: Column(
                          mainAxisAlignment: MainAxisAlignment.spaceBetween,
                          crossAxisAlignment: CrossAxisAlignment.start,
                          children: <Widget>[
                            Text(
                              itemData[index].discription,
                              style: AppTextStyles.smallGrey,
                              maxLines: 30,
                            ),
                          ],
                        ),
                      ),
                      headerBuilder: (BuildContext context, bool isExpanded) {
                        return Container(
                          padding:const  EdgeInsets.all(10),
                          child: Text(
                            itemData[index].headerItem,
                            style: AppTextStyles.mediumBlackBold_17,
                          ),
                        );
                      },
                      isExpanded: itemData[index].expanded,
                    )
                  ],
                  expansionCallback: (int item, bool status) {
                    setState(() {
                      itemData[index].expanded = !itemData[index].expanded;
                    });
                  },
                );
              },
            ),
          ),
        ),
      ),
    );
  }

  //TODO: GO TO QA FORM SERVER
  List<ItemModel> itemData = <ItemModel>[
    ItemModel(
      headerItem: "السؤال الأول  هنا " ,
      discription: " هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل" ,
      expanded: true,
    ),
    ItemModel(
      headerItem: "السؤال الثاني هنا " ,
      discription: " هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   " ,
      expanded: false,
    ),
    ItemModel(
      headerItem: "السؤال الثالث هنا " ,
      discription: " هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   " ,
      expanded: false,
    ),
    ItemModel(
      headerItem: "السؤال الرابع هنا " ,
      discription: " هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   " ,
      expanded: false,
    ),
    ItemModel(
      headerItem: "السؤال الخامس هنا " ,
      discription: " هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   " ,
      expanded: false,
    ),
    ItemModel(
      headerItem: "السؤال السادس هنا " ,
      discription: " هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   " ,
      expanded: false,
    ),
    ItemModel(
      headerItem: "السؤال السابع هنا " ,
      discription: " هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   هذا النص مثال لنص يمكن ان يستبدل   " ,
      expanded: false,
    ),
  ];
}

class ItemModel {
  bool expanded;
  String headerItem;
  String discription;

  ItemModel(
      {required this.headerItem,
      required this.discription,
      required this.expanded});
}
