import 'package:flutter/material.dart';
import 'package:soom/style/text_style.dart';

class OldReports extends StatefulWidget {
  const OldReports({Key? key}) : super(key: key);

  @override
  State<OldReports> createState() => _OldReportsState();
}

class _OldReportsState extends State<OldReports> {

  List<ReportModel> item = [
    //TODO: GET ALL REPORTS FORM SERVER
    ReportModel(
      "عنوان التواصل 1  ",
      "2022-10-20",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
    ), ReportModel(
      "عنوان التواصل 11  ",
      "2022-10-20",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعملخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
    ), ReportModel(
      "عنوان التواصل 12  ",
      "2022-10-20",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
    ), ReportModel(
      "عنوان التواصل 41  ",
      "2022-10-20",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
    ), ReportModel(
      "عنوان التواصل5 1  ",
      "2022-10-20",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
    ), ReportModel(
      "عنوان التواصل 16  ",
      "2022-10-20",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
    ), ReportModel(
      "عنوان التواصل 17 ",
      "2022-10-20",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
      "هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل هذا نص يمكنك استبداله بنص اخر في نفس المساحة والطول والعمل ",
    ),
  ];
  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: const EdgeInsets.symmetric(horizontal: 16.0 , vertical: 24),
      child: ListView.separated(
        itemCount: item.length,
        itemBuilder:(context, index) => GestureDetector(
          onTap: ()async {
           await showDialog(context: context, builder:(context )=>  ListView(
             children: [
               AlertDialog(
                 title: Text(item[index].title , textDirection: TextDirection.rtl, maxLines: 2,),
                 content: Directionality(
                   textDirection: TextDirection.rtl,
                   child: Column(
                     mainAxisSize: MainAxisSize.min,
                     children: [
                     const  Text("المشكلة : " , style: AppTextStyles.mediumBlue,textDirection: TextDirection.rtl,) ,
                       Text(item[index].body , style: AppTextStyles.smallGrey, maxLines: 50,),
                     const   Text("الرد  :" , style: AppTextStyles.mediumBlue,textDirection: TextDirection.rtl) ,
                       Text(item[index].reply , style: AppTextStyles.smallGrey, textDirection: TextDirection.rtl , maxLines: 50,),
                     ],
                   ),
                 ),

               ),
             ],
           ));
          },
          child: Column(
            children: [
              Row(
                children:  [
                  Expanded(child: Text(
                    item[index].title ,
                    style: AppTextStyles.mediumBlackBold, maxLines: 1,)),
                 const Text("2022-10-05" , style: AppTextStyles.smallBlue,),
                ],
              ),
              const SizedBox(height: 16,),
              Text(
                item[index].body,
              maxLines: 2,
                style:  AppTextStyles.smallGrey,
              ),

            ],
          ),
        ),
        separatorBuilder: (context , index)=> const Divider(),
      ),
    );
  }
}

class ReportModel {
  String title ;
  String body ;
  String date ;
  String reply ;

  ReportModel(this.title , this.date , this.body , this.reply);
}